//****************************************************
//
//	小人ベース
//	作成者：伊地田真衣
//	
//	2021/12/03 : 作成(伊地田)
//	2021/12/11 : ターゲットの座標いれる関数を追加した気がする(伊地田)
//	2021/12/21 : ソース名を変更(伊地田)
//				 赤青小人判定用の変数追加(伊地田)
//
//****************************************************

//========================= インクルード部 ===========================
#include "DwarfBase.h"

//====================================================================
//
//		コンストラクタ
//
//====================================================================
DwarfBase::DwarfBase():m_AttackFlg(false),m_rbFlg(true),m_aliveFlg(true)
{
	//----- 変数初期化 -----
	m_collisionType = COLLISION_DYNAMIC;	// 小人は動く物体
	m_FollowFlg = false;
}


//====================================================================
//
//		デストラクタ
//
//====================================================================
DwarfBase::~DwarfBase() 
{

}


//====================================================================
//
//		更新処理
//
//====================================================================
void DwarfBase::Update() {

}


//====================================================================
//
//		描画処理
//
//====================================================================
void DwarfBase::Draw() 
{
	/* 以下はテクスチャが来たら使用 */
	SHADER->SetWorld(
		DirectX::XMMatrixScaling(
			m_size.x, m_size.y, m_size.z)
		* DirectX::XMMatrixTranslation(
			m_pos.x, m_pos.y, m_pos.z));

	m_pCube->Draw();	
}


//====================================================================
//
//		ターゲットの座標をいれる
//		作成者：伊地田真衣
//		戻り値 : void
//		引数   : ターゲットの座標
//
//====================================================================
void DwarfBase::TargetPos(XMFLOAT3 pos) 
{
	m_targetPos = pos;
}

//====================================================================
//
//		攻撃フラグセット
//		作成者：伊地田真衣
//		戻り値 : void
//		引数   : セットしたい方trueで攻撃
//
//====================================================================
void DwarfBase::SetAttackFlg(bool flg)
{
	m_AttackFlg = flg;
}

//====================================================================
//
//		攻撃フラグ取得
//		作成者：伊地田真衣
//		戻り値 : 攻撃フラグ
//		引数   : void
//
//====================================================================
bool DwarfBase::GetAttackFlg()
{
	return m_AttackFlg;
}


//====================================================================
//
//		赤青フラグセット
//		作成者：伊地田真衣
//		戻り値 : void
//		引数   : 赤小人か青小人かtrue：赤、false：青
//
//====================================================================
void DwarfBase::SetRBFlg(bool flg) 
{
	m_rbFlg = flg;
}


//====================================================================
//
//		赤青フラグ取得
//		作成者：伊地田真衣
//		戻り値 : 赤小人か青小人かtrue：赤、false：青
//		引数   : void
//
//====================================================================
bool DwarfBase::GetRBFlg()
{
	return m_rbFlg;
}
