//****************************************************
//
//	ピクミン（仮名）ベース
//	作成者：伊地田真衣
//	
//	2021/12/03 : 作成
//	2021/12/11 : ターゲットの座標いれる関数を追加した気がする
//
//****************************************************

//========================= インクルード部 ===========================
#include "PikminBase.h"

//====================================================================
//
//		コンストラクタ
//
//====================================================================
PikminBase::PikminBase():m_hp(10),m_energy(50),m_AttackFlg(false)
{
	//----- 変数初期化 -----
	m_collisionType = COLLISION_DYNAMIC;	// ピクミンは動く物体
	m_FollowFlg = false;
}


//====================================================================
//
//		デストラクタ
//
//====================================================================
PikminBase::~PikminBase() 
{

}


//====================================================================
//
//		更新処理
//
//====================================================================
void PikminBase::Update() {

}


//====================================================================
//
//		描画処理
//
//====================================================================
void PikminBase::Draw() 
{
	/* 以下はテクスチャが来たら使用 */
	SHADER->SetWorld(
		DirectX::XMMatrixScaling(
			m_size.x, m_size.y, m_size.z)
		* DirectX::XMMatrixTranslation(
			m_pos.x, m_pos.y, m_pos.z));

	m_pCube->Draw();	
}


//====================================================================
//
//		ターゲットの座標をいれる
//		戻り値 : void
//		引数   : ターゲットの座標
//
//====================================================================
void PikminBase::TargetPos(XMFLOAT3 pos) 
{
	m_targetPos = pos;
}

void PikminBase::SetAttackFlg(bool flg) {
	m_AttackFlg = flg;
}

bool PikminBase::GetAttackFlg() {
	return m_AttackFlg;
}
