//====================================================================
//
// 影[Shadow.h]
// 作成者:吉原飛鳥
// 
// 更新日:2022/01/24	作成
//====================================================================

/* -----------------インクルードガード------------------ */
#pragma once

 //*******************************************************************************
 // インクルード部
 //*******************************************************************************
#include	"Texture.h"
#include	"GamePolygon.h"
#include	"Camera.h"

 //*******************************************************************************
 // クラス宣言
 //*******************************************************************************
class Shadow
{
public:
	Shadow();
	~Shadow();

	//---関数
	void Init();
	void Uninit();
	void Update();
	void Draw();

	void SetShadow(XMFLOAT3 pos);


private:
	ID3D11ShaderResourceView* m_pShadowTex;

	GamePolygon* m_pPolygonShadow;
	Camera* m_pCameraShadow;
};

