//====================================================================
//
// 影[Shadow.h]
// 作成者:吉原飛鳥
// 
// 更新日:2022/01/18	作成
//====================================================================

/* -----------------インクルードガード------------------ */
#pragma once

 //*******************************************************************************
 // インクルード部
 //*******************************************************************************
#include	"GameObject.h"
#include	"Camera.h"

//---モデル描画
#include	"Texture.h"
#include	"FBX/FBXPlayer.h"
#include	"DrawBuffer.h"

 //*******************************************************************************
 // クラス宣言
 //*******************************************************************************
class Shadow : public GameObject
{
public:
	Shadow();
	~Shadow();

	//---関数
	bool Init();
	void Uninit();
	void Update();
	void Draw();

	XMFLOAT3 GetShadowPos();									// 影の座標取得
	void CreateShadow(XMFLOAT3 pos,float radius);	// 影の生成										// 影の生成

	//---テクスチャ読み込み
	ID3D11ShaderResourceView *m_pShadowTex;		// テクスチャ

private:
	//---モデル読み込み

	Camera* m_pCamera;							// カメラ情報

};
