//====================================================================
//
// 影[Shadow.h]
// 作成者:吉原飛鳥
// 
// 更新日:2022/01/24	作成
//====================================================================

/* -----------------インクルードガード------------------ */
#pragma once

 //*******************************************************************************
 // インクルード部
 //*******************************************************************************
#include	"Texture.h"
#include	"GameObject.h"
#include	"Camera.h"

 //*******************************************************************************
 // クラス宣言
 //*******************************************************************************
class Shadow : public GameObject
{
public:
	Shadow();
	~Shadow();

	//---関数
			bool Init();
			void Uninit();
	virtual void Update();
			void Draw();

	void SetShadow(XMFLOAT3 pos);


private:
	ID3D11ShaderResourceView* m_pShadowTex;

	GameObject* m_pPolygonShadow;
	Camera* m_pCameraShadow;
};

